#include <iostream>
#include <vector>
#include <string>
#include <cstring> 
#include <queue>
#include <utility>

/*
 	现在你有一个类MAP_BASE，请编写他的子类，继承于MAP_BASE
 	可以看到map_in是一张地图，定义.是空地，#是障碍物，现在有一个的机器人想从左上角到达右下角，请在子类中写一个函数完成这件事情
 	要求：1.将机器人中心走过的路用C表示出来并输出整个地图
		  2.机器人是四向移动的，即只能向上下左右移动
      	  3.机器人走过的路线为所有可行的路线中最短的
	
	注意：答案不唯一，只要输出一种答案就可
	加分条件：现实中机器人是有大小的，不可能完全让中心靠墙移动，现在假设机器人需要3x3的空地才能安全移动，请给出能让机器人安全移动的路径

	示例：

	#############################	#############################			#############################
	#..............###..........#	#.C............###..........#			#.C............###..........#
	#........###................#	#.C......###................#			#.C......###................#
	#.........................###	#.C.......................###			#.C.......................###	
	#.........................###	#.CCCCCCCCCCCCCCCCCC......###			#.C.......................###
	#....................########	#..................C.########			#.C..................########
	#.....#####.................#	#.....#####........C........#			#.C...#####.................#
	#...........................#	#..................CCCCCCCC.#			#.CCCCCCCCCCCCCCCCCCCCCCCCC.#
	#...........................#	#...........................#			#...........................#
	#############################中	#############################是安全的而	 #############################是不安全的因为通过了2x2的空地
	同时
	#############################	           #############################
	#.C............###..........#	           #.C............###..........#
	#.C......###................#	           #.C......###................#
	#.C.......................###	           #.C.......................###	
	#.CCCCCCCCCCCCCC..........###	           #.CCCCCCCCCCCC.CCCCC......###
	#..............C.....########	           #............C.C...C.########
	#.....#####....C............#	           #.....#####..C.C...C........#
	#..............CCCCCCCCCCCC.#	           #............CCC...CCCCCCCC.#
	#...........................#			   #...........................#
	#############################也是可行的而	#############################是不可行的因为这不是最短路

*/
class MAP_BASE
{
	public:
		MAP_BASE()
		{
			map_in = {
	        "#######################################################################",
	        "#.............................................######...........##.....#",
	        "#...........#############........................######.......#########",
	        "#...........#####...........................###...####.......##########",
	        "##.............##.............#######.................................#",
	        "###...................................................................#",
	        "#.........####................######.......................####.......#",
	        "#..........##.........#.##...................######...................#",
	        "#.....................................................................#",
	        "#.............................##................................#######",
	        "#.....................................................................#",
	        "##########.............#######..########......#########...............#",
	        "#...............................###############.......................#",
	        "#######################################################################"
			};
			std::memset(visit, false, sizeof(visit));
		}
		
		void print()
		{
			for (const auto& line : map_in)
		        std::cout << line << '\n';
		}
	protected:
		std::vector<std::string> map_in;
		bool visit[100][100];
};

/**
*在map_in中将'.'替换成'C'表示机器人的路径。将最终的结果像示例里那样输出出来
*
* 提示：
* (1) 没有思路的同学可以先去了解一下深度优先搜索算法和广度优先搜索算法，思考应该用哪种方法。
* (2) 考虑使用队列queue数据结构
*
* 考点：
* (1) 类的使用。
* (2) 搜索算法。
*/

//IMPLEMENT YOUR CODE HERE
using namespace std;
class SHORTEST_PATH : public MAP_BASE {
	public:
	bool is_3x3_clear (int r, int c){
		for (int i = -1; i <= 1; ++i){
			for (int j = -1; j <= 1; ++j){
				if(map_in[r + i][c + j] == '#') return false;
			}
		}
		return true;
	}
	void path(){
		const int W = 70, H = 14;
		int dist[H][W];
		for (int r = 0;r < H; ++r){
			for (int c = 0;c < W; ++c){
				dist[r][c] = -1;
			}
		}
		queue<pair<int,int>> bfs;
		dist[2][2] = 0;
		bfs.push({2,2});
		int dr[4] = {-1,1,0,0};
		int dc[4] = {0,0,-1,1};
		while (!bfs.empty()){
			pair<int,int> cur = bfs.front();
			bfs.pop();
			if (cur.first == 11 && cur.second == 68) break;
			for (int i = 0; i < 4; ++i){
				int nr = cur.first + dr[i], nc = cur.second + dc[i];
				if (nr >= 2 && nr <=11 && nc >= 2 && nc <= 68 &&
					is_3x3_clear(nr,nc) &&
					dist[nr][nc] == -1){
						bfs.push({nr,nc});
						dist[nr][nc] = dist[cur.first][cur.second] + 1;
				}
			}
		}
		int r = 11, c = 68;
	while (r != 2 || c != 2){
		bool found = false;
		for (int i = 0; i < 4; ++i){
			map_in[r][c] = 'C';
			int nr = r + dr[i], nc = c + dc[i];
			if (nr >= 2 && nr <= 11 && nc >= 2 && nc <= 68 &&
				is_3x3_clear(nr,nc) &&
				dist[nr][nc] == dist[r][c] - 1){
				r = nr, c = nc;
				found = true;
			}
		}
		if (!found) break;
	}
	map_in[2][2] = 'C';
	}
};
int main (){
    SHORTEST_PATH navigator;
    navigator.path();
    navigator.print();
}